//Павел, добрый вечер! в настоящий момент в процессе решения))) 
//мучаю уже несколько часов две задачи

//Задача номер 3 (по списку)

Console.Write("Введите любое целое число ");
int number = Convert.ToInt32(Console.ReadLine());

if(number = number / number)
Console.WriteLine("Число является чётным");

else
Console.WriteLine("Число является нечётным");