//Павел, добрый вечер! в настоящий момент в процессе решения))) 
//мучаю уже несколько часов две задачи

//Задача номер 3 (по списку)

Console.Write("Введите любое целое число ");
int number = Convert.ToInt32(Console.ReadLine());

if(number <= 0 && number / 2);

Console.WriteLine("Число является чётным");

if(number > 0);

Console.WriteLine("Число является нечётным");